[
	{
		"q": "Какие криптосистемы называются симметричными?",
		"a": "+ Известна зависимость:  kр= f(kз)<br />+ Если ключ зашифрования совпадает с ключом расшифрования<br />- Шифры однозначной замены<br />- Алгоритмы шифрования и расшифрования одинаковые"
	},
	{
		"q": "Алгоритмы шифров Виженера и Белазо одинаковы, разница только в процедуре формирования ключа",
		"a": "+ Верно<br />- Неверно"
	},
	{
		"q": "По какому алгоритму работают криптосистемы в режиме гаммирования по ГОСТ Р 34.13-2015?",
		"a": "+ Открытые данные зашифровываются в режиме гаммирования путем поразрядного суммирования по модулю 2<br />- Открытые данные зашифровываются в режиме гаммирования путем поразрядного суммирования по модулю 2 только в криптосистеме МАГМА, в криптосистеме Кузнечик гаммирование по другому алгоритму<br />- Открытые данные зашифровываются в режиме гаммирования путем поразрядного суммирования по модулю 232"
	},
	{
		"q": "Какие шифры относятся к шифрам замены?",
		"a": "+ Бесконфликтного<br />- CSMA/CD<br />- С ограниченным числом конфликтов<br />- Настойчивым CSMA"
	},
	{
		"q": "Bit-map протокол можно про любой протокол спросить) является примером протокола:",
		"a": "+ Омофоны<br />+ Если текст предварительно разделяется на блоки, которые затем зашифровываются как отдельный элемент<br />+ это класс шифров, в которых каждой букве алфавита ставится в соответствие шифробозначение: буква, цифра, символ или какая-нибудь их комбинация.<br />+ Если соответствие предполагает несколько шифробозначений для каждой буквы открытого алфавита,<br />- Когда столбцы в процессе шифрования заменяются строками"
	},
	{
		"q": "В биграммном шифре Плейфера предобработка открытого текста происходит по следующему алгоритму:",
		"a": "+ Текст прежде всего проверяется на одинаковые символы в шифрвеличинах<br />- Текст разбивается на блоки в соответствие с длиной ключа<br />- Текст прежде всего проверяется по количеству символов на четность. В случае нечетного числа в конец добавляется случайная буква"
	},
	{
		"q": "По какому правилу работает алгоритм шифра Решетка Кардано, если размер текста не кратен размеру решетки?",
		"a": "+ управления взаимодействием с заказчиками<br />- распределения заказов между производителями<br />- управления поставками"
	},
	{
		"q": "По какому правилу работает алгоритм шифра Решетка Кардано, если размер текста не кратен размеру решетки?",
		"a": "+ последняя строка заполняется «нерабочими» буквами<br />- последняя строка не заполняется «нерабочими» буквами<br />- Выбирается решетка в соответствие с длиной текста"
	},
	{
		"q": "По какому правилу работает алгоритм шифра вертикальной перестановки, если размер текста не кратен размеру таблицы?",
		"a": "+ последняя строка не заполняется «нерабочими» буквами<br />- Выбирается таблица в соответствие с длиной текста<br />- последняя строка заполняется «нерабочими» буквами"
	},
	{
		"q": "В алгоритме шифрования А5/2 выходной бит системы — результат операции XOR над выходными битами всех трех регистров.",
		"a": "+ Неверно<br />- Верно"
	},
	{
		"q": "Перечислите параметры криптосистемы ГОСТ Р 34.12-2015 Кузнечик",
		"a": "+ побайтовое линейное преобразование<br />+ количество раундов - 10<br />+ длина блока 128 бит <br />+ размер ключа 256 бит <br />- длина блока 64 бита <br />- размер ключа 128 бит <br />- количество раундов 32<br />- побитовое линейное преобразование"
	},
	{
		"q": "Алгоритмы блочного шифрования ГОСТ Р 34.12-2015 в качестве нелинейного биективного преобразования используют 16-ти разрядную подстановку ",
		"a": "+ Неверно<br />- Верно"
	}
]